Учет_ФК/src/Documents/ПоступлениеПродукцииИзТранспортировки/ПоступлениеПродукцииИзТранспортировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеПродукцииИзТранспортировки</name>
  <basedOn>Document.ТранспортировкаПродукции</basedOn>
  <registerRecords>AccumulationRegister.ПродукцияВПути</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПродукцииНаСкладе</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоперевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DocumentRef.ТранспортировкаПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>ТранспортировочноеМесто</name>
      <type>
        <types>CatalogRef.ТранспортировочныеМеста</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияПродукции</name>
      <type>
        <types>CatalogRef.ПартииПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесБруттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПломбы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерМестаВПартии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтметкаОПолучении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>CatalogRef.ПричиныОтказаВПриемеПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыявленноеНарушение</name>
      <type>
        <types>CatalogRef.ВидыНарушенийПриТранспортировке</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_ФК/src/AccumulationRegisters/ОстаткиПродукцииНаСкладе/ОстаткиПродукцииНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПродукцииНаСкладе</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоСухой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПартияПродукции</name>
    <type>
      <types>CatalogRef.ПартииПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортировочноеМесто</name>
    <type>
      <types>CatalogRef.ТранспортировочныеМеста</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СостояниеХраниния</name>
    <type>
      <types>EnumRef.СостоянияХранения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Учет_ФК/src/AccumulationRegisters/ПродукцияВПути/ПродукцияВПути.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПродукцияВПути</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоСухой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПартияПродукции</name>
    <type>
      <types>CatalogRef.ПартииПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортировочноеМесто</name>
    <type>
      <types>CatalogRef.ТранспортировочныеМеста</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Учет_ФК/src/InformationRegisters/ДанныеЗатаркиТранспортировочныхМест/ДанныеЗатаркиТранспортировочныхМест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеЗатаркиТранспортировочныхМест</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииПродукции</types>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерПломбы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерМеста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоСухой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТранспортировочноеМесто</name>
    <type>
      <types>CatalogRef.ТранспортировочныеМеста</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_ФК/src/Enums/СостоянияХранения/СостоянияХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияХранения</name>
  <enumValues>
    <name>Хранение</name>
  </enumValues>
  <enumValues>
    <name>Транспортировка</name>
  </enumValues>
  <enumValues>
    <name>ХранениеНекондиции</name>
  </enumValues>
</mdclass:Enum>

Учет_ФК/src/Documents/ПоступлениеПродукцииИзТранспортировки/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ОстаткиПродукцииНаСкладе.Очистить();
	Движения.ОстаткиПродукцииНаСкладе.Записать(Истина);
	Движения.ПродукцияВПути.Очистить();
	Движения.ПродукцияВПути.Записать(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиПродукцииНаСкладеОстатки.Организация КАК Организация,
		|	ОстаткиПродукцииНаСкладеОстатки.Склад КАК Склад,
		|	ОстаткиПродукцииНаСкладеОстатки.ПартияПродукции КАК ПартияПродукции,
		|	ОстаткиПродукцииНаСкладеОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиПродукцииНаСкладеОстатки.ТранспортировочноеМесто КАК ТранспортировочноеМесто,
		|	СУММА(ОстаткиПродукцииНаСкладеОстатки.КоличествоОстаток) КАК КоличествоОстаток,
		|	ДанныеЗатаркиТранспортировочныхМест.Влажность КАК Влажность,
		|	ОстаткиПродукцииНаСкладеОстатки.КоличествоМестОстаток КАК КоличествоМестОстаток,
		|	0 КАК КоличествоСписано,
		|	СУММА(ОстаткиПродукцииНаСкладеОстатки.ВесНеттоСухойОстаток) КАК ВесНеттоСухойОстаток,
		|	СУММА(ОстаткиПродукцииНаСкладеОстатки.ВесНеттоВлажныйОстаток) КАК ВесНеттоВлажныйОстаток,
		|	СУММА(ОстаткиПродукцииНаСкладеОстатки.ВесБруттоВлажныйОстаток) КАК ВесБруттоВлажныйОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиПродукцииНаСкладе.Остатки(
		|			&МоментВремени,
		|			ТранспортировочноеМесто В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ПоступлениеПродукцииИзТранспортировкиПродукция.ТранспортировочноеМесто КАК ТранспортировочноеМесто
		|					ИЗ
		|						Документ.ПоступлениеПродукцииИзТранспортировки.Продукция КАК ПоступлениеПродукцииИзТранспортировкиПродукция
		|					ГДЕ
		|						ПоступлениеПродукцииИзТранспортировкиПродукция.Ссылка = &СсылкаНаДокументПеремещение)
		|				И Организация = &Организация
		|				И Склад = &Склад
		|				И СостояниеХраниния = ЗНАЧЕНИЕ(перечисление.СостоянияХранения.Транспортировка)) КАК ОстаткиПродукцииНаСкладеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеЗатаркиТранспортировочныхМест КАК ДанныеЗатаркиТранспортировочныхМест
		|		ПО ОстаткиПродукцииНаСкладеОстатки.ТранспортировочноеМесто = ДанныеЗатаркиТранспортировочныхМест.ТранспортировочноеМесто
		|ГДЕ
		|	ДанныеЗатаркиТранспортировочныхМест.ТранспортировочноеМесто В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ПоступлениеПродукцииИзТранспортировкиПродукция.ТранспортировочноеМесто КАК ТранспортировочноеМесто
		|			ИЗ
		|				Документ.ПоступлениеПродукцииИзТранспортировки.Продукция КАК ПоступлениеПродукцииИзТранспортировкиПродукция
		|			ГДЕ
		|				ПоступлениеПродукцииИзТранспортировкиПродукция.Ссылка = &СсылкаНаДокументПеремещение)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиПродукцииНаСкладеОстатки.Номенклатура,
		|	ОстаткиПродукцииНаСкладеОстатки.Организация,
		|	ОстаткиПродукцииНаСкладеОстатки.ПартияПродукции,
		|	ОстаткиПродукцииНаСкладеОстатки.ТранспортировочноеМесто,
		|	ОстаткиПродукцииНаСкладеОстатки.Склад,
		|	ДанныеЗатаркиТранспортировочныхМест.Влажность,
		|	ОстаткиПродукцииНаСкладеОстатки.КоличествоМестОстаток
		|
		|ДЛЯ ИЗМЕНЕНИЯ";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("СсылкаНаДокументПеремещение", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаОстатков = РезультатЗапроса.Выгрузить();
	
	Для каждого СтрокаТаблицы из Продукция Цикл 
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ПартияПродукции", СтрокаТаблицы.ПартияПродукции);
		СтруктураПоиска.Вставить("ТранспортировочноеМесто",СтрокаТаблицы.ТранспортировочноеМесто);
		
		МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураПоиска);
		
		Если МассивСтрокОстатков.Количество()  = 0 Тогда 
			ТекстСообщения = "В строке №"+Формат(СтрокаТаблицы.НомерСтроки,"ЧГ=")+" не корректно указано транспортировочное место."+ Символы.ПС +
							"По данным учета транспортировочное место № " + СтрокаТаблицы.ТранспортировочноеМесто + Символы.ПС+
							"из партии продукции № " + СтрокаТаблицы.ПартияПродукции.Код + " не числится в статусе ""Транспортировка""";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, "", "Объект", Отказ);
			Отказ = Истина;	
		Иначе
			СтрокаТаблицыОстатков = МассивСтрокОстатков[0];
		
			Если СтрокаТаблицыОстатков.КоличествоМестОстаток >= 1 Тогда
				
				Если СтрокаТаблицы.ОтметкаОПолучении Тогда 
				
					СтрокаТаблицыОстатков.КоличествоМестОстаток = СтрокаТаблицыОстатков.КоличествоМестОстаток - 1;
					СтрокаТаблицыОстатков.КоличествоСписано = СтрокаТаблицыОстатков.КоличествоСписано + 1;
		
					Движения.ОстаткиПродукцииНаСкладе.Записывать = Истина;			
					Движения.ПродукцияВПути.Записывать = Истина;			
					
					Движение = Движения.ОстаткиПродукцииНаСкладе.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.Склад = Склад;
					Движение.ПартияПродукции = СтрокаТаблицы.ПартияПродукции;
					Движение.Номенклатура = СтрокаТаблицы.ПартияПродукции.Номенклатура;
					Движение.ТранспортировочноеМесто = СтрокаТаблицы.ТранспортировочноеМесто;
					Движение.СостояниеХраниния = Перечисления.СостоянияХранения.Транспортировка;
					Движение.Количество 		= СтрокаТаблицыОстатков.КоличествоОстаток;
				    Движение.КоличествоМест 	= 1;
					Движение.ВесНеттоСухой		= СтрокаТаблицыОстатков.ВесНеттоСухойОстаток;
					Движение.ВесНеттоВлажный	= СтрокаТаблицыОстатков.ВесНеттоВлажныйОстаток;
					Движение.ВесБруттоВлажный	= СтрокаТаблицыОстатков.ВесБруттоВлажныйОстаток;
					
					Движение = Движения.ОстаткиПродукцииНаСкладе.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.Склад = СкладПолучатель;
					Движение.ПартияПродукции = СтрокаТаблицы.ПартияПродукции;
					Движение.Номенклатура = СтрокаТаблицы.ПартияПродукции.Номенклатура;
					Движение.ТранспортировочноеМесто = СтрокаТаблицы.ТранспортировочноеМесто;
					Движение.СостояниеХраниния = Перечисления.СостоянияХранения.Хранение;
					Движение.Количество 		= СтрокаТаблицыОстатков.КоличествоОстаток;
					Движение.КоличествоМест 	= 1;
					Движение.ВесНеттоСухой		= СтрокаТаблицыОстатков.ВесНеттоСухойОстаток;
					Движение.ВесНеттоВлажный	= СтрокаТаблицыОстатков.ВесНеттоВлажныйОстаток;
					Движение.ВесБруттоВлажный	= СтрокаТаблицыОстатков.ВесБруттоВлажныйОстаток;
				
					Движение = Движения.ПродукцияВПути.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.СкладОтправитель = Склад;
					Движение.СкладПолучатель = СкладПолучатель;
					Движение.ПартияПродукции = СтрокаТаблицы.ПартияПродукции;
					Движение.Номенклатура = СтрокаТаблицы.ПартияПродукции.Номенклатура;
					Движение.ТранспортноеСредство = ТранспортноеСредство;
					Движение.ТранспортировочноеМесто = СтрокаТаблицы.ТранспортировочноеМесто;
					Движение.Перевозчик = Грузоперевозчик;
					Движение.Количество 		= СтрокаТаблицыОстатков.КоличествоОстаток;
					Движение.КоличествоМест 	= 1;
					Движение.ВесНеттоСухой		= СтрокаТаблицыОстатков.ВесНеттоСухойОстаток;
					Движение.ВесНеттоВлажный	= СтрокаТаблицыОстатков.ВесНеттоВлажныйОстаток;
					Движение.ВесБруттоВлажный	= СтрокаТаблицыОстатков.ВесБруттоВлажныйОстаток;
					
				ИначеЕсли Не СтрокаТаблицы.ОтметкаОПолучении
							и СтрокаТаблицы.ПричинаОтказа = Справочники.ПричиныОтказаВПриемеПродукции.НеОтгруженПоставщиком Тогда
							//делаем возврат на скалад отправитель по учету
							
					СтрокаТаблицыОстатков.КоличествоМестОстаток = СтрокаТаблицыОстатков.КоличествоМестОстаток - 1;
					СтрокаТаблицыОстатков.КоличествоСписано = СтрокаТаблицыОстатков.КоличествоСписано + 1;
			
					Движения.ОстаткиПродукцииНаСкладе.Записывать = Истина;			
					Движения.ПродукцияВПути.Записывать = Истина;			
				
					Движение = Движения.ОстаткиПродукцииНаСкладе.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.Склад = Склад;
					Движение.ПартияПродукции = СтрокаТаблицы.ПартияПродукции;
					Движение.Номенклатура = СтрокаТаблицы.ПартияПродукции.Номенклатура;
					Движение.ТранспортировочноеМесто = СтрокаТаблицы.ТранспортировочноеМесто;
					Движение.СостояниеХраниния = Перечисления.СостоянияХранения.Хранение;
					Движение.Количество 		= СтрокаТаблицыОстатков.КоличествоОстаток;
					Движение.КоличествоМест 	= 1;
					Движение.ВесНеттоСухой		= СтрокаТаблицыОстатков.ВесНеттоСухойОстаток;
					Движение.ВесНеттоВлажный	= СтрокаТаблицыОстатков.ВесНеттоВлажныйОстаток;
					Движение.ВесБруттоВлажный	= СтрокаТаблицыОстатков.ВесБруттоВлажныйОстаток;
			
					Движение = Движения.ОстаткиПродукцииНаСкладе.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.Склад = Склад;
					Движение.ПартияПродукции = СтрокаТаблицы.ПартияПродукции;
					Движение.Номенклатура = СтрокаТаблицы.ПартияПродукции.Номенклатура;
					Движение.ТранспортировочноеМесто = СтрокаТаблицы.ТранспортировочноеМесто;
					Движение.СостояниеХраниния = Перечисления.СостоянияХранения.Транспортировка;
					Движение.Количество 		= СтрокаТаблицыОстатков.КоличествоОстаток;
				    Движение.КоличествоМест 	= 1;
					Движение.ВесНеттоСухой		= СтрокаТаблицыОстатков.ВесНеттоСухойОстаток;
					Движение.ВесНеттоВлажный	= СтрокаТаблицыОстатков.ВесНеттоВлажныйОстаток;
					Движение.ВесБруттоВлажный	= СтрокаТаблицыОстатков.ВесБруттоВлажныйОстаток;
				
					Движение = Движения.ПродукцияВПути.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.СкладОтправитель = Склад;
					Движение.СкладПолучатель = СкладПолучатель;
					Движение.ПартияПродукции = СтрокаТаблицы.ПартияПродукции;
					Движение.Номенклатура = СтрокаТаблицы.ПартияПродукции.Номенклатура;
					Движение.ТранспортноеСредство = ТранспортноеСредство;
					Движение.ТранспортировочноеМесто = СтрокаТаблицы.ТранспортировочноеМесто;
					Движение.Перевозчик = Грузоперевозчик;
					Движение.Количество 		= СтрокаТаблицыОстатков.КоличествоОстаток;
					Движение.КоличествоМест 	= 1;
					Движение.ВесНеттоСухой		= СтрокаТаблицыОстатков.ВесНеттоСухойОстаток;
					Движение.ВесНеттоВлажный	= СтрокаТаблицыОстатков.ВесНеттоВлажныйОстаток;
					Движение.ВесБруттоВлажный	= СтрокаТаблицыОстатков.ВесБруттоВлажныйОстаток;
							
				Иначе
							
					СтрокаТаблицыОстатков.КоличествоМестОстаток = СтрокаТаблицыОстатков.КоличествоМестОстаток - 1;
					СтрокаТаблицыОстатков.КоличествоСписано = СтрокаТаблицыОстатков.КоличествоСписано + 1;
			
					Движения.ОстаткиПродукцииНаСкладе.Записывать = Истина;			
					Движения.ПродукцияВПути.Записывать = Истина;			
				
					Движение = Движения.ОстаткиПродукцииНаСкладе.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.Склад = СкладПолучатель;
					Движение.ПартияПродукции = СтрокаТаблицы.ПартияПродукции;
					Движение.Номенклатура = СтрокаТаблицы.ПартияПродукции.Номенклатура;
					Движение.ТранспортировочноеМесто = СтрокаТаблицы.ТранспортировочноеМесто;
					Движение.СостояниеХраниния = Перечисления.СостоянияХранения.ХранениеНекондиции;
					Движение.Количество 		= СтрокаТаблицыОстатков.КоличествоОстаток;
					Движение.КоличествоМест 	= 1;
					Движение.ВесНеттоСухой		= СтрокаТаблицыОстатков.ВесНеттоСухойОстаток;
					Движение.ВесНеттоВлажный	= СтрокаТаблицыОстатков.ВесНеттоВлажныйОстаток;
					Движение.ВесБруттоВлажный	= СтрокаТаблицыОстатков.ВесБруттоВлажныйОстаток;
					
				
					Движение = Движения.ОстаткиПродукцииНаСкладе.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.Склад = Склад;
					Движение.ПартияПродукции = СтрокаТаблицы.ПартияПродукции;
					Движение.Номенклатура = СтрокаТаблицы.ПартияПродукции.Номенклатура;
					Движение.ТранспортировочноеМесто = СтрокаТаблицы.ТранспортировочноеМесто;
					Движение.СостояниеХраниния = Перечисления.СостоянияХранения.Транспортировка;
					Движение.Количество 		= СтрокаТаблицыОстатков.КоличествоОстаток;
				    Движение.КоличествоМест 	= 1;
					Движение.ВесНеттоСухой		= СтрокаТаблицыОстатков.ВесНеттоСухойОстаток;
					Движение.ВесНеттоВлажный	= СтрокаТаблицыОстатков.ВесНеттоВлажныйОстаток;
					Движение.ВесБруттоВлажный	= СтрокаТаблицыОстатков.ВесБруттоВлажныйОстаток;
				
				
					Движение = Движения.ПродукцияВПути.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.СкладОтправитель = Склад;
					Движение.СкладПолучатель = СкладПолучатель;
					Движение.ПартияПродукции = СтрокаТаблицы.ПартияПродукции;
					Движение.Номенклатура = СтрокаТаблицы.ПартияПродукции.Номенклатура;
					Движение.ТранспортноеСредство = ТранспортноеСредство;
					Движение.ТранспортировочноеМесто = СтрокаТаблицы.ТранспортировочноеМесто;
					Движение.Перевозчик = Грузоперевозчик;
					Движение.Количество 		= СтрокаТаблицыОстатков.КоличествоОстаток;
					Движение.КоличествоМест 	= 1;
					Движение.ВесНеттоСухой		= СтрокаТаблицыОстатков.ВесНеттоСухойОстаток;
					Движение.ВесНеттоВлажный	= СтрокаТаблицыОстатков.ВесНеттоВлажныйОстаток;
					Движение.ВесБруттоВлажный	= СтрокаТаблицыОстатков.ВесБруттоВлажныйОстаток;
					
				КонецЕсли;
			
			Иначе
			ТекстСообщения = "В строке №"+Формат(СтрокаТаблицы.НомерСтроки,"ЧГ=")+" не корректно указано транспортировочное место."+ Символы.ПС +
							"По данным учета транспортировочное место № " + СтрокаТаблицы.ТранспортировочноеМесто + Символы.ПС+
							"из партии продукции № " + СтрокаТаблицы.ПартияПродукции.Код + " не числится в статусе ""Транспортировка""";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, "", "Объект", Отказ);
				Отказ = Истина;	
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
	
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию(ПараметрыСеанса.ТекущийПользователь.Наименование);	
	СкладПолучатель = Справочники.Склады.СкладПоУмолчанию(ПараметрыСеанса.ТекущийПользователь.Наименование);
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ТранспортировкаПродукции") Тогда
		// Заполнение шапки
		Грузоперевозчик = ДанныеЗаполнения.Грузоперевозчик;
		Организация = ДанныеЗаполнения.Организация;
		Склад = ДанныеЗаполнения.Склад;
		СкладПолучатель = ДанныеЗаполнения.СкладПолучатель;
		ДокументОтгрузки = ДанныеЗаполнения.Ссылка;
		ТранспортноеСредство = ДанныеЗаполнения.ТранспортноеСредство;
		Для Каждого ТекСтрокаПродукция Из ДанныеЗаполнения.Продукция Цикл
			НоваяСтрока = Продукция.Добавить();
			НоваяСтрока.ВесБруттоВлажный = ТекСтрокаПродукция.ВесБруттоВлажный;
			НоваяСтрока.ВесНеттоВлажный = ТекСтрокаПродукция.ВесНеттоВлажный;
			НоваяСтрока.НомерМестаВПартии = ТекСтрокаПродукция.НомерМестаВПартии;
			НоваяСтрока.НомерПломбы = ТекСтрокаПродукция.НомерПломбы;
			НоваяСтрока.ПартияПродукции = ТекСтрокаПродукция.ПартияПродукции;
			НоваяСтрока.ТранспортировочноеМесто = ТекСтрокаПродукция.ТранспортировочноеМесто;
			НоваяСтрока.ОтметкаОПолучении = Истина;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ОбщийВес = Продукция.Итог("ВесБруттоВлажный");
КонецПроцедуры
